bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
csholmq.excel-to-markdown-table
davidlgoldberg.jumpy2
davraamides.todotxt-mode
github.copilot
github.copilot-chat
github.github-vscode-theme
hbenl.vscode-test-explorer
hediet.vscode-drawio
ionutvmi.path-autocomplete
janisdd.vscode-edit-csv
jebbs.plantuml
littlefoxteam.vscode-python-test-adapter
marp-team.marp-vscode
mechatroner.rainbow-csv
mhutchie.git-graph
mikoz.black-py
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-ai
ms-toolsai.vscode-ai-remote
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-account
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.test-adapter-converter
njpwerner.autodocstring
oderwat.indent-rainbow
pkief.material-icon-theme
shardulm94.trailing-spaces
shinichi-takii.sql-bigquery
streetsidesoftware.code-spell-checker
tuttieee.emacs-mcx
vstirbu.vscode-mermaid-preview
yzane.markdown-pdf
